backend/app/controllers/petitions_controller.rb

SELECT "petitions".* FROM "petitions"
---
  def index
    petitions = Petition.all

SELECT "petitions".* FROM "petitions" WHERE "petitions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    petition = Petition.find(params[:id])

INSERT INTO "petitions" ("name", "description", "submit_to", "signature_goal", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    petition = Petition.create(
      name: params[:name],
      description: params[:description],
      submit_to: params[:submit_to],
      signature_goal: params[:signature_goal]
    )

SELECT "petitions".* FROM "petitions" WHERE "petitions"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "signatures".* FROM "signatures" WHERE "signatures"."petition_id" = ?  [["petition_id", 22]]
DELETE FROM "signatures" WHERE "signatures"."id" = ?  [["id", 309]]
DELETE FROM "petitions" WHERE "petitions"."id" = ?  [["id", 22]]
---
  def destroy
    petition = Petition.find(params[:id])
    petition.signatures.each do |signature|
      signature.destroy
    end
    petition.destroy

SELECT "petitions".* FROM "petitions" WHERE "petitions"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
INSERT INTO "signees" ("first_name", "last_name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "BILLY"], ["last_name", "BOB-JOE"], ["address", "80224"], ["created_at", "2020-06-09 20:32:46.756334"], ["updated_at", "2020-06-09 20:32:46.756334"]]
INSERT INTO "signatures" ("petition_id", "signee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["petition_id", 22], ["signee_id", 328], ["created_at", "2020-06-09 20:40:18.054553"], ["updated_at", "2020-06-09 20:40:18.054553"]]
---
  def add_signature
    petition = Petition.find(params[:id])
    signee = Signee.create(
      first_name: params[:first_name],
      last_name: params[:last_name],
      address: params[:address]
    )
    Signature.create(petition: petition, signee: signee)

SELECT "petitions".* FROM "petitions" WHERE "petitions"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "petitions" SET "name" = ?, "updated_at" = ? WHERE "petitions"."id" = ?  [["name", "More Library Funding PLEASE"], ["updated_at", "2020-06-09 20:17:52.579104"], ["id", 4]]
---
  def update
    petition = Petition.find(params[:id])
    petition.update(
      name: params[:name],
      description: params[:description],
      submit_to: params[:submit_to],
      signature_goal: params[:signature_goal]
    )