backend/app/controllers/signees_controller.rb

  def index
    signees = Signee.all
---
SELECT "signees".* FROM "signees"